# ООП:

class Dish:

    def __init__(self, name, ingredients, qty, uom):
       self.name = name
       self.ingredients = ingredients
       self.qty = qty
       self.uom = uom

    def purchase_list(self, persons):
        print(f'{self.name.capitalize()}:')
        for i, elem in enumerate(self.ingredients):
            print(elem, self.qty[i] * persons, self.uom[i])

# class Ingredient:
#     def __init__(self, name, qty, uom):
#         self.name = name

persons = 5
salad = Dish('салат', ['картофель', 'морковь', 'огурцы', 'горошек', 'майонез'], [100, 50, 50, 30, 70], ['гр.', 'гр.', 'гр.', 'гр.', 'мл.'])
pizza = Dish('пицца', ['сыр', 'томаты', 'тесто', 'бекон', 'колбаса', 'грибы'], [50, 50, 100, 30, 30, 20], ['гр.', 'гр.', 'гр.', 'гр.', 'гр.', 'гр.'])
fruit_dessert = Dish('фруктовый десерт', ['хурма', 'киви', 'творог', 'сахар', 'мед'], [60, 60, 60, 10, 50], ['гр.', 'гр.', 'гр.', 'гр.', 'мл.'])

salad.purchase_list(persons)
print()
pizza.purchase_list(persons)
print()
fruit_dessert.purchase_list(persons)
#salad.ingredient = 'картофель'

# # Функциональный подход:
# cook_book = [
#   ['салат',
#       [
#         ['картофель', 100, 'гр.'],
#         ['морковь', 50, 'гр.'],
#         ['огурцы', 50, 'гр.'],
#         ['горошек', 30, 'гр.'],
#         ['майонез', 70, 'мл.'],
#       ]
#   ],
#   ['пицца',  
#       [
#         ['сыр', 50, 'гр.'],
#         ['томаты', 50, 'гр.'],
#         ['тесто', 100, 'гр.'],
#         ['бекон', 30, 'гр.'],
#         ['колбаса', 30, 'гр.'],
#         ['грибы', 20, 'гр.'],
#       ],
#   ],
#   ['фруктовый десерт',
#       [
#         ['хурма', 60, 'гр.'],
#         ['киви', 60, 'гр.'],
#         ['творог', 60, 'гр.'],
#         ['сахар', 10, 'гр.'],
#         ['мед', 50, 'мл.'],  
#       ]
#   ]
# ]

# person = 5

# for i in range(len(cook_book)):
#   print(f'\n{cook_book[i][0].capitalize()}:')
#   for j in range(1, len(cook_book[i])):
#     for k in range(len(cook_book[i][j])):
#         for l in range(len(cook_book[i][j][k])):
#           if l == 0:
#             product = cook_book[i][j][k][l]
#           elif l == 1:
#             qty = cook_book[i][j][k][l] * person
#           else:
#             uom = cook_book[i][j][k][l]
#         print(f'{product}, {qty}{uom} ')

# # Лёхин код:

# for i in cook_book:
#     print(f'\n{(i[0]).capitalize()}:')
#     for j in i[1]:
#         print(f'{j[0]}, {j[1] * persons}{j[2]}')

# Имеется структура данных cook_book, в которой хранится информация об ингредиентах блюд и их количестве в расчете на одну порцию:
# cook_book = [
#   ['салат',
#       [
#         ['картофель', 100, 'гр.'],
#         ['морковь', 50, 'гр.'],
#         ['огурцы', 50, 'гр.'],
#         ['горошек', 30, 'гр.'],
#         ['майонез', 70, 'мл.'],
#       ]
#   ],
#   ['пицца',  
#       [
#         ['сыр', 50, 'гр.'],
#         ['томаты', 50, 'гр.'],
#         ['тесто', 100, 'гр.'],
#         ['бекон', 30, 'гр.'],
#         ['колбаса', 30, 'гр.'],
#         ['грибы', 20, 'гр.'],
#       ],
#   ],
#   ['фруктовый десерт',
#       [
#         ['хурма', 60, 'гр.'],
#         ['киви', 60, 'гр.'],
#         ['творог', 60, 'гр.'],
#         ['сахар', 10, 'гр.'],
#         ['мед', 50, 'мл.'],  
#       ]
#   ]
# ]
# и переменная, в которой хранится количество людей, на которых необходимо приготовить данные блюда:
# person = 5
# Необходимо вывести пользователю список покупок необходимого количества ингредиентов для приготовления блюд на определенное число персон в следующем виде:
# Салат:
# картофель, 500гр.
# морковь, 250гр.
# огурцы, 250гр.
# горошек, 150гр.
# майонез, 350мл.

# Пицца:
# сыр, 250гр.
# томаты, 250гр.
# тесто, 500гр.
# бекон, 150гр.
# колбаса, 150гр.
# грибы, 100гр.

# Фруктовый десерт:
# хурма, 300гр.
# киви, 300гр.
# творог, 300гр.
# сахар, 50гр.
# мед, 250мл.
# Внимание! Реализация не должна зависеть от количества блюд, их названий и количества ингредиентов в них!
